# Exercise

In this exercise, your job is to show demonstrate "something interesting" about the relationship between the life expectancy and the country wealth, as measured by Gross Domestic Product (GDP) per capita. 

It is up to you to decide what is "something interesting". This can be emphasizing a specific country (your native country), or a general tendency.

## Setup

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pylab as plt
import json
import seaborn as sns
%matplotlib inline

In [11]:
life_expectancy = pd.read_excel(
    '../data/life_expectancy.xls', sheet_name='Data', header=3
)[['Country Name', 'Country Code', '2014']].dropna()
life_expectancy.tail()

                 Country Name Country Code       2014
249             Liechtenstein          LIE  82.260976
250  St. Martin (French part)          MAF  79.321951
257                    Serbia          SRB  75.534146
259                Seychelles          SYC  73.229268
263        West Bank and Gaza          PSE  72.904024

In [12]:
gdp = pd.read_excel(
    '../data/GDP_per_capita.xlsx', sheet_name='Data'
)[['Country Name', 'Country Code', '2014']].dropna()
gdp.tail()

         Country Name Country Code         2014
258             Samoa          WSM  4172.217100
260      South Africa          ZAF  6472.101027
261  Congo, Dem. Rep.          COD   437.814931
262            Zambia          ZMB  1725.974549
263          Zimbabwe          ZWE   931.198185

In [15]:
tbl_data = life_expectancy.merge(
    gdp, 
    on=['Country Name', 'Country Code'], suffixes=('_life_expectancy', '_gdp'),
    how='inner'
).dropna()
tbl_data.tail()

           Country Name Country Code  2014_life_expectancy      2014_gdp
221              Israel          ISR             82.153659  37206.182942
222              Kosovo          KSV             71.097561   4073.819117
223              Serbia          SRB             75.534146   6200.173221
224          Seychelles          SYC             73.229268  15563.794218
225  West Bank and Gaza          PSE             72.904024   2960.778004

## It's your turn